app/Controllers/usuario_controller.php

    public function eliminar_usuario()
    {
        $id_usuario = $this->request->getVar('id_usuario');
        $formModel = new usuario_Model();
        //elimina logicamente estableciendo el campo baja en "SI"
        $datab = ['baja' => 'SI'];
        $formModel->update($id_usuario, $datab);
---
UPDATE `usuarios` SET `baja` = 'SI'
WHERE `usuarios`.`id_usuario` IN ('14')

    public function reestablecer_usuario()
    {
        $id_usuario = $this->request->getVar('id_usuario');
        $formModel = new usuario_Model();
        //reestablece logicamente el campo baja en "NO", por ende, el usuario.
        $datab = ['baja' => 'NO'];
        $formModel->update($id_usuario, $datab);
---
UPDATE `usuarios` SET `baja` = 'NO'
WHERE `usuarios`.`id_usuario` IN ('8')