app/Models/usuario_Model.php

    public function getAllUsuariosActivos()
    {
        return $this->where('baja', 'NO')->findAll();
---
SELECT *
FROM `usuarios`
WHERE `baja` = 'NO'

    public function getAllUsuariosEliminados()
    {
        return $this->where('baja', 'SI')->findAll();
---
SELECT *
FROM `usuarios`
WHERE `baja` = 'SI'

    public function getUsuarioByDNI($dni)
    {
        return $this->where('dni', $dni)->first();
---
SELECT *
FROM `usuarios`
WHERE `dni` = '25333112'
 LIMIT 1